contents/index.org
#+title: Papers
* Links
[[https://systemcrafters.net/publishing-websites-with-org-mode/building-the-site/][tutorial org to html]]
[[http://127.0.0.1:8080][localhost]]
[[file:remember.org][remember]]
* Programas geniales
🆒
** emacs
*** publish html
[[https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html][publishing tutorial]]
** broot
:e para editar en wvim
** fasd
*** TODO practicar git
** baobab
analizador de espacio del disco
* Bash
- tail -c 9 # quita los ultimos 9 caracteres
- >/dev/null 2>&1 # output to null
* Keyboard
** [[https://wiki.debian.org/XCompose][Compose key]]
#+begin_src bash

~/.xsessionrc: trato en .zshrc
xmodmap -e "keysym Control_R = Multi_key"

~/.XCompose:
include "%L"   # import the default Compose file for your locale
<Multi_key> <Multi_key> <a> : "ã"
<Multi_key> <Multi_key> <o> : "õ"
<Multi_key> <Multi_key> <e> : "ê"

#+end_src
* Boot
** grabar iso
#+begin_src bash

sudo lsblk
cp debian12.iso /dev/sdg
sync

dd if=debian.iso of=/dev/sdX (no probado)

#+end_src

#+begin_src bash
sudo update-grub o sudo grub-mkconfig -o /boot/grub/grub.cfg
/etc/grub.d  # custom entries
menuentry "Debian 12" {
  insmod ext2
  set isofile="/debian12.iso"
  loopback loop (hd1,1)$isofile
  linux (loop)/live/vmlinuz-6.1.0-10-amd64 boot=live findiso=$isofile
  initrd (loop)/live/initrd.img-6.1.0-10-amd64
}
#+end_src
* Doom
** install
#+begin_src bash
sudo apt install emacs
git clone --depth 1 https://github.com/doomemacs/doomemacs ~/.config/emacs
~/.config/emacs/bin/doom install
#+end_src

rmdir -rf ~/.emacs.d para que arranque doom
directorios doom:
- .config/doom
- .config/emacs
- .config/emacs/bin
- .emacs.d/.local/straight/repos/themes/themes/
* Rclone
rclone mount pcloud:/ pcloudfolder --vfs-cache-mode=full
* Python
** enviroment
python3 -m venv env
source env/bin/activate
pip install ....
which python
pip freeze > requirements.txt
pip list
deactivate
pip install -r requirements.txt
** pyqt5
*** iconos
#+begin_src python
import iconosResource_rc # pyrcc5 iconosResource.qrc -o iconosResource_rc.py
self.st = QSystemTrayIcon(QIcon(":/iconos/antena.png")) # se puede copiar path en designer
#+end_src
* Latex
[[https://www.youtube.com/watch?v=0qHloGTT8XE][youtube tutorial]] [[https://wiki.debian.org/Latex][debian wiki]]
sudo apt-get install texlive-latex-extra
#+begin_src org
#+title: Latex
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [letterpaper]
#+OPTIONS: toc:nil
texto
#+end_src
* Cinnamon
[[https://www.cinnamon-look.org][cinnamon look]]
** ~/.icons [[file:~/.icons/][icons]]
- iconos
- cursors
** ~/.themes
** ~/.local/share/applications [[file:~/.local/share/applications/][applications]]
** ~/.local/share/fonts [[~/.local/share/fonts][fonts]]
