docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-04-29 lun 17:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Papers</title>
<meta name="author" content="waltermas" />
<meta name="generator" content="Org Mode" />

<link rel='stylesheet' href='https://cdn.simplecss.org/simple.min.css' />
<link rel='icon' type='image/x-icon' href='./img/favicon_io/favicon.ico'>
<link rel='apple-touch-icon' sizes='180x180' href='./img/favicon_io/apple-touch-icon.png'>
<link rel='icon' type='image/png' sizes='32x32' href='./img/favicon_io/favicon-32x32.png'>
<link rel='icon' type='image/png' sizes='16x16' href='./img/favicon_io/favicon-16x16.png'>
<link rel=imanifest' href='./img/favicon_io/site.webmanifest'>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Papers</h1>
<div id="outline-container-orga490a06" class="outline-2">
<h2 id="orga490a06">Links</h2>
<div class="outline-text-2" id="text-orga490a06">
<p>
<a href="https://systemcrafters.net/publishing-websites-with-org-mode/building-the-site/">tutorial org to html</a>
<a href="http://127.0.0.1:8080">localhost</a>
<a href="remember.html">remember</a>
</p>
</div>
</div>
<div id="outline-container-org66c2ef6" class="outline-2">
<h2 id="org66c2ef6">Programas geniales</h2>
<div class="outline-text-2" id="text-org66c2ef6">
<p>
🆒
</p>
</div>
<div id="outline-container-orgbd2bd8d" class="outline-3">
<h3 id="orgbd2bd8d">emacs</h3>
<div class="outline-text-3" id="text-orgbd2bd8d">
</div>
<div id="outline-container-org93f1a89" class="outline-4">
<h4 id="org93f1a89">publish html</h4>
<div class="outline-text-4" id="text-org93f1a89">
<p>
<a href="https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">publishing tutorial</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org985c23c" class="outline-3">
<h3 id="org985c23c">broot</h3>
<div class="outline-text-3" id="text-org985c23c">
<p>
:e para editar en wvim
</p>
</div>
</div>
<div id="outline-container-orgb0304de" class="outline-3">
<h3 id="orgb0304de">fasd</h3>
<div class="outline-text-3" id="text-orgb0304de">
</div>
<div id="outline-container-org7a077f6" class="outline-4">
<h4 id="org7a077f6"><span class="todo TODO">TODO</span> practicar git</h4>
</div>
</div>
<div id="outline-container-orgba1c036" class="outline-3">
<h3 id="orgba1c036">baobab</h3>
<div class="outline-text-3" id="text-orgba1c036">
<p>
analizador de espacio del disco
</p>
</div>
</div>
</div>
<div id="outline-container-org42ea9a2" class="outline-2">
<h2 id="org42ea9a2">Bash</h2>
<div class="outline-text-2" id="text-org42ea9a2">
<ul class="org-ul">
<li>tail -c 9 # quita los ultimos 9 caracteres</li>
<li>&gt;/dev/null 2&gt;&amp;1 # output to null</li>
</ul>
</div>
</div>
<div id="outline-container-orgf54afb8" class="outline-2">
<h2 id="orgf54afb8">Keyboard</h2>
<div class="outline-text-2" id="text-orgf54afb8">
</div>
<div id="outline-container-org4d3e884" class="outline-3">
<h3 id="org4d3e884"><a href="https://wiki.debian.org/XCompose">Compose key</a></h3>
<div class="outline-text-3" id="text-org4d3e884">
<div class="org-src-container">
<pre class="src src-bash">
~/.xsessionrc: trato en .zshrc
xmodmap -e <span style="font-style: italic;">"keysym Control_R = Multi_key"</span>

~/.XCompose:
include <span style="font-style: italic;">"%L"</span>   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">import the default Compose file for your locale</span>
&lt;Multi_key&gt; &lt;Multi_key&gt; &lt;a&gt; : <span style="font-style: italic;">"&#227;"</span>
&lt;Multi_key&gt; &lt;Multi_key&gt; &lt;o&gt; : <span style="font-style: italic;">"&#245;"</span>
&lt;Multi_key&gt; &lt;Multi_key&gt; &lt;e&gt; : <span style="font-style: italic;">"&#234;"</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgee07bb2" class="outline-2">
<h2 id="orgee07bb2">Boot</h2>
<div class="outline-text-2" id="text-orgee07bb2">
</div>
<div id="outline-container-orge957d2d" class="outline-3">
<h3 id="orge957d2d">grabar iso</h3>
<div class="outline-text-3" id="text-orge957d2d">
<div class="org-src-container">
<pre class="src src-bash">
sudo lsblk
cp debian12.iso /dev/sdg
sync

dd <span style="font-weight: bold; font-style: italic;">if</span>=debian.iso <span style="font-weight: bold; font-style: italic;">of</span>=/dev/sdX (no probado)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">sudo update-grub o sudo grub-mkconfig -o /boot/grub/grub.cfg
/etc/grub.d  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">custom entries</span>
menuentry <span style="font-style: italic;">"Debian 12"</span> {
  insmod ext2
  <span style="font-weight: bold;">set</span> <span style="font-weight: bold; font-style: italic;">isofile</span>=<span style="font-style: italic;">"/debian12.iso"</span>
  loopback loop (hd1,1)$<span style="font-weight: bold; font-style: italic;">isofile</span>
  linux (loop)/live/vmlinuz-6.1.0-10-amd64 <span style="font-weight: bold; font-style: italic;">boot</span>=live <span style="font-weight: bold; font-style: italic;">findiso</span>=$<span style="font-weight: bold; font-style: italic;">isofile</span>
  initrd (loop)/live/initrd.img-6.1.0-10-amd64
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4c96a5f" class="outline-2">
<h2 id="org4c96a5f">Doom</h2>
<div class="outline-text-2" id="text-org4c96a5f">
</div>
<div id="outline-container-orgcf8a104" class="outline-3">
<h3 id="orgcf8a104">install</h3>
<div class="outline-text-3" id="text-orgcf8a104">
<div class="org-src-container">
<pre class="src src-bash">sudo apt install emacs
git clone --depth 1 https://github.com/doomemacs/doomemacs ~/.config/emacs
~/.config/emacs/bin/doom install
</pre>
</div>

<p>
rmdir -rf ~/.emacs.d para que arranque doom
directorios doom:
</p>
<ul class="org-ul">
<li>.config/doom</li>
<li>.config/emacs</li>
<li>.config/emacs/bin</li>
<li>.emacs.d/.local/straight/repos/themes/themes/</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org64c89a4" class="outline-2">
<h2 id="org64c89a4">Rclone</h2>
<div class="outline-text-2" id="text-org64c89a4">
<p>
rclone mount pcloud:/ pcloudfolder &#x2013;vfs-cache-mode=full
</p>
</div>
</div>
<div id="outline-container-orgd52b7ce" class="outline-2">
<h2 id="orgd52b7ce">Python</h2>
<div class="outline-text-2" id="text-orgd52b7ce">
</div>
<div id="outline-container-org29e2dc2" class="outline-3">
<h3 id="org29e2dc2">enviroment</h3>
<div class="outline-text-3" id="text-org29e2dc2">
<p>
python3 -m venv env
source env/bin/activate
pip install &#x2026;.
which python
pip freeze &gt; requirements.txt
pip list
deactivate
pip install -r requirements.txt
</p>
</div>
</div>
<div id="outline-container-org594381d" class="outline-3">
<h3 id="org594381d">pyqt5</h3>
<div class="outline-text-3" id="text-org594381d">
</div>
<div id="outline-container-org26a8ca5" class="outline-4">
<h4 id="org26a8ca5">iconos</h4>
<div class="outline-text-4" id="text-org26a8ca5">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> iconosResource_rc <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">pyrcc5 iconosResource.qrc -o iconosResource_rc.py</span>
<span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">st</span> = QSystemTrayIcon(QIcon(<span style="font-style: italic;">":/iconos/antena.png"</span>)) <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">se puede copiar path en designer</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf2ea281" class="outline-2">
<h2 id="orgf2ea281">Latex</h2>
<div class="outline-text-2" id="text-orgf2ea281">
<p>
<a href="https://www.youtube.com/watch?v=0qHloGTT8XE">youtube tutorial</a> <a href="https://wiki.debian.org/Latex">debian wiki</a>
sudo apt-get install texlive-latex-extra
</p>
<div class="org-src-container">
<pre class="src src-org">#+title: <span style="font-weight: bold;">Latex</span>
<span style="font-weight: bold; font-style: italic;">#+LaTeX_CLASS: article</span>
<span style="font-weight: bold; font-style: italic;">#+LaTeX_CLASS_OPTIONS: [letterpaper]</span>
<span style="font-weight: bold; font-style: italic;">#+OPTIONS: toc:nil</span>
texto
</pre>
</div>
</div>
</div>
<div id="outline-container-org89afee5" class="outline-2">
<h2 id="org89afee5">Cinnamon</h2>
<div class="outline-text-2" id="text-org89afee5">
<p>
<a href="https://www.cinnamon-look.org">cinnamon look</a>
</p>
</div>
<div id="outline-container-org1a16fd0" class="outline-3">
<h3 id="org1a16fd0">~/.icons <a href="file:///home/waltermas/.icons/">icons</a></h3>
<div class="outline-text-3" id="text-org1a16fd0">
<ul class="org-ul">
<li>iconos</li>
<li>cursors</li>
</ul>
</div>
</div>
<div id="outline-container-orgf6c8ad4" class="outline-3">
<h3 id="orgf6c8ad4">~/.themes</h3>
</div>
<div id="outline-container-orgd3c4ff5" class="outline-3">
<h3 id="orgd3c4ff5">~/.local/share/applications <a href="file:///home/waltermas/.local/share/applications/">applications</a></h3>
</div>
<div id="outline-container-org3f1dd8e" class="outline-3">
<h3 id="org3f1dd8e">~/.local/share/fonts <a href="file:///home/waltermas/.local/share/fonts">fonts</a></h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: waltermas</p>
<p class="date">Created: 2024-04-29 lun 17:11</p>
</div>
</body>
</html>
